import React, { Fragment } from "react";

const HeaderInfo = () => {
  return (
    <div className="header-info">
      <h2>مقالات قسم</h2>
      <h1>مرحلة ما قبل الزواج</h1>
      <p>
        هذا النص هو مثال لنص يمكن أن ستبدل في نفس المساحة لقد تم توليد هاذ النص بشكل اوتوماتيكي بشكل اوتوماتيكي بشكل  تم توليد هذا النص هو مثال لنص يمكن أن ستبدل هذا النص هو مثال لنص يمكن أن ستبدل هذا النص هو مثال لنص يمكن أن ستبدل في نفس المساحة لقد تم توليد هاذ النص بشكل اوتوماتيكي بشكل اوتوماتيكي بشكل  تم توليد هذا النص هو   ستبدل
      </p>
    </div>
  );
};

export default HeaderInfo;
